AccumulationRegisters/РазметкаАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РазметкаАУСН</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиРазметкиАУСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскаяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПризнакНалоговойБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиНалоговойБазыАУСН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииОперацийАУСН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПредупрежденияПриЗагрузкеВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПредупрежденияПриЗагрузкеВыписки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтрокаВыписки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщенияПользователю</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщенияАвтоматическойВыписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеНМА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеНМА</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрочиеРасчеты</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПродаж</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПриУСН</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.РасходыАУСН</xr:Item>
				<xr:Item>AccumulationRegister.НДСРаздельныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.РублевыеСуммыДокументовВВалюте</xr:Item>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>InformationRegister.СостоянияНМАОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
				<xr:Item>InformationRegister.РасчетПереоценкиВалютныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.НДСВключенныйВСтоимость</xr:Item>
				<xr:Item>AccumulationRegister.РазметкаАУСН</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
				<xr:Item>InformationRegister.ЖурналУчетаСчетовФактур</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗачетаАвансов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключенВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовПоАвансам</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПредъявленСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНомерВходящегоСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаВходящегоСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНДСПредъявленКВычету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодСпособаПолучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НематериальныеАктивы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НематериальныйАктив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУСН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗачетАвансов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументАванса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗачета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ИнтеграцияАУСНБП/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция НайтиПоИдентификаторуАУСН(Выписки) Экспорт
	
	ИспользуемыеИдентификаторы = Новый Массив;
	Для Каждого Выписка Из Выписки Цикл
		Для Каждого Операция Из Выписка.Значение.Операции Цикл
			Если ЗначениеЗаполнено(Операция.ИдентификаторАУСН) Тогда
				ИспользуемыеИдентификаторы.Добавить(Операция.ИдентификаторАУСН);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БанковскиеДокументыАУСН.Документ КАК Документ,
		|	БанковскиеДокументыАУСН.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.БанковскиеДокументыАУСН КАК БанковскиеДокументыАУСН
		|ГДЕ
		|	БанковскиеДокументыАУСН.Идентификатор В (&ИдентификаторыАУСН)";
	
	Запрос.УстановитьПараметр("ИдентификаторыАУСН", ИспользуемыеИдентификаторы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НайденныеДокументы = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		НайденныеДокументы.Вставить(Выборка.Идентификатор, Выборка.Документ);
	КонецЦикла;
	
	Возврат НайденныеДокументы;
	
КонецФункции

Процедура ЗаполнитьДокументыАУСН(РаспознаннаяВыписка, Выписка, ДокументыАУСН) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументыАУСН) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Операция Из Выписка.Операции Цикл
		Если ЗначениеЗаполнено(Операция.ИдентификаторАУСН) Тогда
			НайденныйДокумент = ДокументыАУСН.Получить(Операция.ИдентификаторАУСН);
			Если НайденныйДокумент <> Неопределено Тогда
				РаспознаннаяОперация = ЗагрузкаВыпискиПоБанковскомуСчету.НайтиПоИдентификатору(
					РаспознаннаяВыписка.Операции, Операция.Идентификатор);
				РаспознаннаяОперация.Ссылка = НайденныйДокумент;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьПолученныеБанковскиеВыписки(Документ, ДанныеДокумента, ДополнительныеПараметры) Экспорт
	
	БанковскиеДокументы = ЗагрузкаВыпискиПоБанковскомуСчету.ЗагрузитьВыпискуИзСервисаАУСН(
		Документ, ДанныеДокумента, ДополнительныеПараметры);
	Если БанковскиеДокументы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеВФорматеСервиса = БанковскиеДокументы.ДанныеВФорматеСервиса;
	БанковскиеОперации = БанковскиеДокументы.СозданныеДокументы.ВыгрузитьКолонку("Ссылка");
	НеобходимостьОтправкиРазметкиВБанк = ОтправлятьРазметкуАУСНВБанк(
		Документ.Тип, БанковскиеОперации, Документ.Организация);
	Для Каждого СтрокаДокумента Из БанковскиеДокументы.СозданныеДокументы Цикл
		ИдентификаторАУСН = СтрокаДокумента.ИдентификаторАУСН;
		ОтправитьВБанк = СтрокаДокумента.Успешно;
		Если ОтправитьВБанк И НеобходимостьОтправкиРазметкиВБанк <> Неопределено Тогда
			ПараметрыПоиска = Новый Структура("Ссылка", СтрокаДокумента.Ссылка);
			ДанныеОтправки = НеобходимостьОтправкиРазметкиВБанк.НайтиСтроки(ПараметрыПоиска);
			Если ДанныеОтправки.Количество() > 0 Тогда
				ОтправитьВБанк = ДанныеОтправки[0].ОтправитьВБанк;
			КонецЕсли;
		КонецЕсли;
		МенеджерЗаписи = РегистрыСведений.БанковскиеДокументыАУСН.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Организация = Документ.Организация;
		МенеджерЗаписи.Документ = СтрокаДокумента.Ссылка;
		МенеджерЗаписи.Прочитать();
		Если Не МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Организация = Документ.Организация;
			МенеджерЗаписи.Документ = СтрокаДокумента.Ссылка;
		КонецЕсли;
		МенеджерЗаписи.Идентификатор = ИдентификаторАУСН;
		МенеджерЗаписи.ОтправитьВБанк = ОтправитьВБанк;
		МенеджерЗаписи.ИдентификаторПолучателя = БанковскиеДокументы.ИдентификаторПолучателя;
		МенеджерЗаписи.ДанныеВФорматеСервиса = Новый ХранилищеЗначения(ДанныеВФорматеСервиса[ИдентификаторАУСН]);
		МенеджерЗаписи.Записать();
	КонецЦикла; 
	ОбработатьОтветНаОтправленныеБанковскиеВыписки(Документ, ДанныеДокумента, ДополнительныеПараметры.ОписаниеОшибок);
	
	Если Не ДополнительныеПараметры.Свойство("БанковскиеВыписки") Тогда
		ДополнительныеПараметры.Вставить("БанковскиеВыписки", Новый Массив);
	КонецЕсли;
	
	БанкПоКлассификатору = БанковскиеДокументы.Банк;
	БИК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанкПоКлассификатору, "Код");
	Банк = РаботаСБанкамиБП.НайтиБанк(БИК);
	
	Выписка = Новый Структура;
	Выписка.Вставить("ДатаНачала", БанковскиеДокументы.ДатаНачала);
	Выписка.Вставить("ДатаОкончания", БанковскиеДокументы.ДатаОкончания);
	Выписка.Вставить("Организация", Документ.Организация);
	Выписка.Вставить("Банк", Банк);
	Выписка.Вставить("БанкПоКлассификатору", БанкПоКлассификатору);
	Выписка.Вставить("ИдентификаторБанка", Документ.ИдентификаторБанка);
	Выписка.Вставить("ЗагруженоДокументов", БанковскиеДокументы.СозданныеДокументы.Количество());

	ДополнительныеПараметры.БанковскиеВыписки.Добавить(Выписка);
	
КонецПроцедуры

Функция НастройкиИнтеграции(ВключенОтборОрганизация, ОтборОрганизация, ВключенОтборСчет = Ложь, ОтборСчет = Неопределено) Экспорт
	
	Настройки = НовыйНастройкиИнтеграции();
	Если ВключенОтборОрганизация Тогда
		Настройки.Организация = ОтборОрганизация;
	КонецЕсли;
	Если ВключенОтборСчет И ЗначениеЗаполнено(ОтборСчет) Тогда
		БИК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтборСчет, "Банк.Код");
		Настройки.Банк = РаботаСБанкамиБП.СсылкаПоКлассификатору(БИК);
	КонецЕсли;
	Возврат Настройки;
	
КонецФункции

// Отключает автоматический обмен с ДиректБанком при подключении к сервису АУСН
//
// Параметры:
//  Записи - РегистрСведенийНаборЗаписей.СостоянияИнтеграцииАУСН
//
Процедура ОтключитьАвтообменДиректБанк(Записи) Экспорт
	
	ОтключаемыеЗначения = Новый ТаблицаЗначений;
	ОтключаемыеЗначения.Колонки.Добавить("Организация", Метаданные.ОпределяемыеТипы.Организация.Тип);
	ОтключаемыеЗначения.Колонки.Добавить("Банк", Новый ОписаниеТипов("СправочникСсылка.КлассификаторБанков"));
	
	СостояниеПодключено = Перечисления.СостоянияИнтеграцииАУСН.Подключено;
	
	Для Каждого Запись Из Записи Цикл
		Если Запись.Состояние = СостояниеПодключено Тогда
			Строка = ОтключаемыеЗначения.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Запись);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтключаемыеЗначения.Организация КАК Организация,
		|	ОтключаемыеЗначения.Банк КАК Банк
		|ПОМЕСТИТЬ ВТ_ОтключаемыеЗначения
		|ИЗ
		|	&ОтключаемыеЗначения КАК ОтключаемыеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиОбменСБанками.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НастройкиОбмена
		|ИЗ
		|	ВТ_ОтключаемыеЗначения КАК ВТ_ОтключаемыеЗначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиОбменСБанками КАК НастройкиОбменСБанками
		|		ПО ВТ_ОтключаемыеЗначения.Организация = НастройкиОбменСБанками.Организация
		|			И ВТ_ОтключаемыеЗначения.Банк.Код = НастройкиОбменСБанками.Банк.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыОбменСБанками.НастройкаОбмена КАК НастройкаОбмена
		|ИЗ
		|	РегистрСведений.ПараметрыОбменСБанками КАК ПараметрыОбменСБанками
		|ГДЕ
		|	ПараметрыОбменСБанками.НастройкаОбмена В
		|			(ВЫБРАТЬ
		|				ВТ_НастройкиОбмена.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_НастройкиОбмена КАК ВТ_НастройкиОбмена)
		|	И ПараметрыОбменСБанками.АвтоматическоеПолучениеВыписки";
	
	Запрос.УстановитьПараметр("ОтключаемыеЗначения", ОтключаемыеЗначения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НастройкиЗадания = ОбменСБанкамиСлужебный.НовыеНастройкиЗаданияАвтоматическойВыписки(Выборка.НастройкаОбмена,
			"БезНастроек");
		ОбменСБанкамиСлужебный.УстановитьНастройкиЗаданияАвтоматическойВыписки(НастройкиЗадания);
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьОтправкуВБанк(БанковскиеОперации, ОтправитьВБанк) Экспорт
	
	Если Не ЗначениеЗаполнено(БанковскиеОперации) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеДокументыАУСН.Организация КАК Организация,
		|	БанковскиеДокументыАУСН.Документ КАК Документ,
		|	БанковскиеДокументыАУСН.Идентификатор КАК Идентификатор,
		|	БанковскиеДокументыАУСН.ОтправитьВБанк КАК ОтправитьВБанк
		|ИЗ
		|	РегистрСведений.БанковскиеДокументыАУСН КАК БанковскиеДокументыАУСН
		|ГДЕ
		|	БанковскиеДокументыАУСН.Документ В(&Документы)
		|	И БанковскиеДокументыАУСН.ОтправитьВБанк <> &ОтправитьВБанк";
	
	Запрос.УстановитьПараметр("Документы", БанковскиеОперации);
	Запрос.УстановитьПараметр("ОтправитьВБанк", ОтправитьВБанк);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Менеджер = РегистрыСведений.БанковскиеДокументыАУСН.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Выборка);
		Менеджер.Прочитать();
		Менеджер.ОтправитьВБанк = ОтправитьВБанк;
		Если Не ЗначениеЗаполнено(Менеджер.СтатусОбменаАУСН) Тогда
			Менеджер.СтатусОбменаАУСН = Перечисления.СтатусыОбменаАУСН.Отправлен;
		КонецЕсли;
		Менеджер.ДатаОбмена = ТекущаяДата();
		Менеджер.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйНастройкиИнтеграции()
	
	Настройки = Новый Структура;
	Настройки.Вставить("Организация", Неопределено);
	Настройки.Вставить("Банк", Неопределено);
	
	Возврат Настройки;
	
КонецФункции

Функция ОтправлятьРазметкуАУСНВБанк(ТипДокумента, БанковскиеОперации, Организация)
	
	Если Не Перечисления.ТипыДокументовАУСН.ЭтоДокументБанковскойВыпискиСРазметкой(ТипДокумента)
		Или БанковскиеОперации.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Проверим, нужно ли отправлять разметку в банк, если загружена разметка из банка.
	// Для этого по каждой банковской операции сравниваем движения регистра РазметкаАУСН
	// с загруженной табличной частью РазметкаАУСНБанка.
	// Если в банковской операции Порядок расчета АУСН = "По данным банка", то получаем только те движения,
	// которые сформировались в результате проведения самой банковской операции или при ручной корректировке.
	// При этом, движения "По данным банка" в общем случае будут совпадать, за исключением, возможно,
	// случаев, когда в документе установлена "Ручная корректировка".
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Ссылка", Метаданные.РегистрыНакопления.РазметкаАУСН.Измерения.БанковскаяОперация.Тип);
	Результат.Колонки.Добавить("ОтправитьВБанк", Новый ОписаниеТипов("Булево"));
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РазметкаАУСНОбороты.БанковскаяОперация КАК БанковскаяОперация,
	|	РазметкаАУСНОбороты.ПризнакНалоговойБазы КАК ПризнакНалоговойБазы,
	|	РазметкаАУСНОбороты.КатегорияОперации КАК КатегорияОперации,
	|	РазметкаАУСНОбороты.СуммаОборот КАК СуммаОборот,
	|	РазметкаАУСНОбороты.ВалютнаяСуммаОборот КАК ВалютнаяСуммаОборот
	|ПОМЕСТИТЬ РазметкаАУСН
	|ИЗ
	|	РегистрНакопления.РазметкаАУСН.Обороты(
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И БанковскаяОперация В (&БанковскиеОперации)) КАК РазметкаАУСНОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазметкаАУСНБанка.Ссылка КАК Ссылка,
	|	РазметкаАУСНБанка.ПризнакНалоговойБазы КАК ПризнакНалоговойБазы,
	|	РазметкаАУСНБанка.КатегорияОперации КАК КатегорияОперации,
	|	РазметкаАУСНБанка.Сумма КАК Сумма,
	|	РазметкаАУСНБанка.ВалютнаяСумма КАК ВалютнаяСумма
	|ПОМЕСТИТЬ РазметкаАУСНБанка
	|ИЗ
	|	(ВЫБРАТЬ
	|		НЕОПРЕДЕЛЕНО КАК Ссылка,
	|		ЗНАЧЕНИЕ(Перечисление.ПризнакиНалоговойБазыАУСН.ПустаяСсылка) КАК ПризнакНалоговойБазы,
	|		ЗНАЧЕНИЕ(Перечисление.КатегорииОперацийАУСН.ПустаяСсылка) КАК КатегорияОперации,
	|		0 КАК Сумма,
	|		0 КАК ВалютнаяСумма
	|	ГДЕ
	|		ЛОЖЬ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеНаРасчетныйСчетРазметкаАУСНБанка.Ссылка,
	|		ПоступлениеНаРасчетныйСчетРазметкаАУСНБанка.ПризнакНалоговойБазы,
	|		ПоступлениеНаРасчетныйСчетРазметкаАУСНБанка.КатегорияОперации,
	|		СУММА(ПоступлениеНаРасчетныйСчетРазметкаАУСНБанка.Сумма),
	|		СУММА(ПоступлениеНаРасчетныйСчетРазметкаАУСНБанка.ВалютнаяСумма)
	|	ИЗ
	|		Документ.ПоступлениеНаРасчетныйСчет.РазметкаАУСНБанка КАК ПоступлениеНаРасчетныйСчетРазметкаАУСНБанка
	|	ГДЕ
	|		ПоступлениеНаРасчетныйСчетРазметкаАУСНБанка.Ссылка В(&БанковскиеОперацииПоступление)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеНаРасчетныйСчетРазметкаАУСНБанка.ПризнакНалоговойБазы,
	|		ПоступлениеНаРасчетныйСчетРазметкаАУСНБанка.КатегорияОперации,
	|		ПоступлениеНаРасчетныйСчетРазметкаАУСНБанка.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписаниеСРасчетногоСчетаРазметкаАУСНБанка.Ссылка,
	|		СписаниеСРасчетногоСчетаРазметкаАУСНБанка.ПризнакНалоговойБазы,
	|		СписаниеСРасчетногоСчетаРазметкаАУСНБанка.КатегорияОперации,
	|		СУММА(СписаниеСРасчетногоСчетаРазметкаАУСНБанка.Сумма),
	|		СУММА(СписаниеСРасчетногоСчетаРазметкаАУСНБанка.ВалютнаяСумма)
	|	ИЗ
	|		Документ.СписаниеСРасчетногоСчета.РазметкаАУСНБанка КАК СписаниеСРасчетногоСчетаРазметкаАУСНБанка
	|	ГДЕ
	|		СписаниеСРасчетногоСчетаРазметкаАУСНБанка.Ссылка В(&БанковскиеОперацииСписание)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписаниеСРасчетногоСчетаРазметкаАУСНБанка.ПризнакНалоговойБазы,
	|		СписаниеСРасчетногоСчетаРазметкаАУСНБанка.КатегорияОперации,
	|		СписаниеСРасчетногоСчетаРазметкаАУСНБанка.Ссылка) КАК РазметкаАУСНБанка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(РазметкаАУСН.БанковскаяОперация, РазметкаАУСНБанка.Ссылка) КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РазметкаАУСН.СуммаОборот ЕСТЬ NULL
	|					ИЛИ РазметкаАУСНБанка.Сумма ЕСТЬ NULL
	|					ИЛИ ЕСТЬNULL(РазметкаАУСН.СуммаОборот, 0) <> ЕСТЬNULL(РазметкаАУСНБанка.Сумма, 0)
	|					ИЛИ ЕСТЬNULL(РазметкаАУСН.ВалютнаяСуммаОборот, 0) <> ЕСТЬNULL(РазметкаАУСНБанка.ВалютнаяСумма, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОтправитьВБанк
	|ИЗ
	|	РазметкаАУСН КАК РазметкаАУСН
	|		ПОЛНОЕ СОЕДИНЕНИЕ РазметкаАУСНБанка КАК РазметкаАУСНБанка
	|		ПО РазметкаАУСН.ПризнакНалоговойБазы = РазметкаАУСНБанка.ПризнакНалоговойБазы
	|			И РазметкаАУСН.КатегорияОперации = РазметкаАУСНБанка.КатегорияОперации
	|			И РазметкаАУСН.БанковскаяОперация = РазметкаАУСНБанка.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(РазметкаАУСН.БанковскаяОперация, РазметкаАУСНБанка.Ссылка)";
	
	ПараметрыОпераций = РазложитьОперацииПоИсточникамРазметки(БанковскиеОперации);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Для Каждого ТекущиеПараметры Из ПараметрыОпераций Цикл
		
		ВсеОперации = ТекущиеПараметры.Значение.Все;
		Если ВсеОперации.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
		Если ТекущиеПараметры.Ключ = "ПоРегистратору" Тогда
			
			ТаблицаРазметкаАУСНОбороты = СхемыЗапросов.НайтиТаблицуПоПсевдониму(СхемаЗапроса, "РазметкаАУСНОбороты");
			ТаблицаРазметкаАУСНОбороты.Таблица.Параметры[2].Выражение = Новый ВыражениеСхемыЗапроса("Регистратор");
			УсловиеПоРегистратору = 
			"(РазметкаАУСНОбороты.Регистратор = РазметкаАУСНОбороты.БанковскаяОперация
			|			ИЛИ ВЫБОР
			|				КОГДА РазметкаАУСНОбороты.Регистратор ССЫЛКА Документ.ПоступлениеДопРасходов
			|					ТОГДА ВЫРАЗИТЬ(РазметкаАУСНОбороты.Регистратор КАК Документ.ПоступлениеДопРасходов).РучнаяКорректировка
			|				КОГДА РазметкаАУСНОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
			|					ТОГДА ВЫРАЗИТЬ(РазметкаАУСНОбороты.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).РучнаяКорректировка
			|				КОГДА РазметкаАУСНОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНМА
			|					ТОГДА ВЫРАЗИТЬ(РазметкаАУСНОбороты.Регистратор КАК Документ.ПоступлениеНМА).РучнаяКорректировка
			|				КОГДА РазметкаАУСНОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
			|					ТОГДА ВЫРАЗИТЬ(РазметкаАУСНОбороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).РучнаяКорректировка
			|				КОГДА РазметкаАУСНОбороты.Регистратор ССЫЛКА Документ.РеализацияОтгруженныхТоваров
			|					ТОГДА ВЫРАЗИТЬ(РазметкаАУСНОбороты.Регистратор КАК Документ.РеализацияОтгруженныхТоваров).РучнаяКорректировка
			|				КОГДА РазметкаАУСНОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|					ТОГДА ВЫРАЗИТЬ(РазметкаАУСНОбороты.Регистратор КАК Документ.РеализацияТоваровУслуг).РучнаяКорректировка
			|				КОГДА РазметкаАУСНОбороты.Регистратор ССЫЛКА Документ.СписаниеСРасчетногоСчета
			|					ТОГДА ВЫРАЗИТЬ(РазметкаАУСНОбороты.Регистратор КАК Документ.СписаниеСРасчетногоСчета).РучнаяКорректировка
			|				ИНАЧЕ ИСТИНА
			|			КОНЕЦ)";
			ОтборПоРегистратору = Новый ВыражениеСхемыЗапроса(УсловиеПоРегистратору);
			ТаблицаРазметкаАУСНОбороты.Оператор.Отбор.Добавить(ОтборПоРегистратору);
		КонецЕсли;
		
		ВложенныйЗапросРазметкаАУСНБанка = СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Источники[0].Источник.Запрос;
		
		ОперацииПоступления = ТекущиеПараметры.Значение.Поступления;
		ОперацииСписания = ТекущиеПараметры.Значение.Списания;
		
		ЕстьСписания = ОперацииСписания.Количество() > 0;
		ЕстьПоступления = ОперацииПоступления.Количество() > 0;
		
		Если Не ЕстьСписания Тогда
			ВложенныйЗапросРазметкаАУСНБанка.Операторы.Удалить(2);
		КонецЕсли;
		Если Не ЕстьПоступления Тогда
			ВложенныйЗапросРазметкаАУСНБанка.Операторы.Удалить(1);
		КонецЕсли;
		Если ЕстьСписания Или ЕстьПоступления Тогда
			ВложенныйЗапросРазметкаАУСНБанка.Операторы.Удалить(0);
		КонецЕсли;
		
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
		Запрос.УстановитьПараметр("БанковскиеОперации", ВсеОперации);
		Запрос.УстановитьПараметр("БанковскиеОперацииПоступление", ОперацииПоступления);
		Запрос.УстановитьПараметр("БанковскиеОперацииСписание", ОперацииСписания);
	
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаРезультата = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультата, Выборка);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РазложитьОперацииПоИсточникамРазметки(БанковскиеОперации)
	
	ИсточникРазметкиОпераций = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(БанковскиеОперации, "ИсточникРазметкиАУСН");
	
	Результат = Новый Структура;
	Результат.Вставить("ПоРегистратору", НовыеПараметрыОперацийПоИсточникамРазметки());
	Результат.Вставить("ПоОперации", НовыеПараметрыОперацийПоИсточникамРазметки());
	
	ТипПоступления = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет");
	ТипСписания = Тип("ДокументСсылка.СписаниеСРасчетногоСчета");
	
	Для Каждого ТекущийИсточникРазметки Из ИсточникРазметкиОпераций Цикл
		Если ТекущийИсточникРазметки.Значение = Перечисления.ИсточникиРазметкиАУСН.Банк Тогда
			ТекущиеПараметры = Результат.ПоРегистратору;
		Иначе
			ТекущиеПараметры = Результат.ПоОперации;
		КонецЕсли;
		ТекущиеПараметры.Все.Добавить(ТекущийИсточникРазметки.Ключ);
		
		ТипДокумента = ТипЗнч(ТекущийИсточникРазметки.Ключ);
		Если ТипДокумента = ТипПоступления Тогда
			ТекущиеПараметры.Поступления.Добавить(ТекущийИсточникРазметки.Ключ);
		ИначеЕсли ТипДокумента = ТипСписания Тогда
			ТекущиеПараметры.Списания.Добавить(ТекущийИсточникРазметки.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НовыеПараметрыОперацийПоИсточникамРазметки()
	
	Результат = Новый Структура;
	Результат.Вставить("Все", Новый Массив);
	Результат.Вставить("Поступления", Новый Массив);
	Результат.Вставить("Списания", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьОтветНаОтправленныеБанковскиеВыписки(Документ, ДанныеДокумента, Ошибки)
	
	ОтветФНС = ДанныеДокумента.Ответ;
	Если Не ТипЗнч(ОтветФНС) = Тип("ОбъектXDTO") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтатусОперации Из ОтветФНС.OperationStatuses Цикл
		ДанныеНаТекущийМомент = РегистрыСведений.БанковскиеДокументыАУСН.ДанныеДокумента( , СтатусОперации.Id);
		Если ВРег(СтатусОперации.StatusCode) = ВРег(ИнтеграцияАУСНКлиентСервер.ИмяСтатусаПринятФНС()) Тогда
			Если ДанныеНаТекущийМомент <> Неопределено
				И ДанныеНаТекущийМомент.СтатусОбменаАУСН = Перечисления.СтатусыОбменаАУСН.Отклонен Тогда
				// Удаляем запись с предупреждением о том, что операция была отклонена
				РегистрыСведений.ПредупрежденияПриЗагрузкеВыписки.ЗаписатьПредупреждение(
					ДанныеНаТекущийМомент.Организация,
					ДанныеНаТекущийМомент.Документ);
			КонецЕсли;
			РегистрыСведений.БанковскиеДокументыАУСН.ИзменитьСтатус(СтатусОперации.Id, Перечисления.СтатусыОбменаАУСН.Принят);
		Иначе
			КодыОшибок = Новый Массив;
			Если ДанныеНаТекущийМомент <> Неопределено Тогда
				РегистрыСведений.ПредупрежденияПриЗагрузкеВыписки.ЗаписатьПредупреждение(
					ДанныеНаТекущийМомент.Организация,
					ДанныеНаТекущийМомент.Документ,
					НСтр("ru = 'Банковская операция АУСН отклонена ФНС'", ОбщегоНазначения.КодОсновногоЯзыка()));
			КонецЕсли;
			Для Каждого ОписаниеОшибки Из СтатусОперации.RefusalToAccept Цикл
				КодыОшибок.Добавить(ОписаниеОшибки.ReasonCode);
			КонецЦикла;
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку("UTF-8");
			ДанныеДокумента.Фабрика.ЗаписатьXML(ЗаписьXML, ОтветФНС, "PostExtendedStatementResponse");
			ОповещатьБанк = ВсеОшибкиОтносятсяКБанку(КодыОшибок);
			РегистрыСведений.БанковскиеДокументыАУСН.ИзменитьСтатус(
				СтатусОперации.Id, Перечисления.СтатусыОбменаАУСН.Отклонен, ОповещатьБанк, ЗаписьXML.Закрыть());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ВсеОшибкиОтносятсяКБанку(КодыОшибок)
	
	Если Не ЗначениеЗаполнено(КодыОшибок) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОшибкиДляОповещенияБанка = Новый Массив;
	ОшибкиДляОповещенияБанка.Добавить("INTERNAL_ERROR");
	ОшибкиДляОповещенияБанка.Добавить("PARTNER_DENY");
	ОшибкиДляОповещенияБанка.Добавить("PERMISSION_NOT_GRANTED");
	ОшибкиДляОповещенияБанка.Добавить("TAXPAYER_NOT_FOUND");
	ОшибкиДляОповещенияБанка.Добавить("TAXPAYER_NOT_BOUND");
	
	Для Каждого КодОшибки Из КодыОшибок Цикл
		Если ОшибкиДляОповещенияБанка.Найти(ВРег(КодОшибки)) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
